[Killed] ProtectedVisibility
Controllers/NotificationController.php:20:5
     }
 
     // Método centralizado para redirecciones
-    protected function redirectTo($url)
+    private function redirectTo($url)
     {
         if (getenv('APP_ENV') === 'testing') {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\NotificationControllerTest.php" not found

[Killed] Identical
Controllers/NotificationController.php:22:9
     // Método centralizado para redirecciones
     protected function redirectTo($url)
     {
-        if (getenv('APP_ENV') === 'testing') {
+        if (getenv('APP_ENV') !== 'testing') {
             // En modo pruebas, almacena la redirección
             $this->redirect = $url;
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\NotificationControllerTest.php" not found

[NoCoverage] FunctionCallRemoval
Controllers/NotificationController.php:27:13
             $this->redirect = $url;
         } else {
             // En producción, realiza la redirección real
-            header("Location: $url");
+            
             exit;
         }

[Killed] PublicVisibility
Controllers/NotificationController.php:33:5
     }
 
     // Crear una notificación
-    public function createNotification($userId, $message)
+    protected function createNotification($userId, $message)
     {
         if (!$userId) {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\NotificationControllerTest.php" not found

[Killed] LogicalNot
Controllers/NotificationController.php:35:9
     // Crear una notificación
     public function createNotification($userId, $message)
     {
-        if (!$userId) {
+        if ($userId) {
             $this->redirectTo('/login');
             return false;
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\NotificationControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/NotificationController.php:36:13
     public function createNotification($userId, $message)
     {
         if (!$userId) {
-            $this->redirectTo('/login');
+            
             return false;
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\NotificationControllerTest.php" not found

[Killed] FalseValue
Controllers/NotificationController.php:37:13
     {
         if (!$userId) {
             $this->redirectTo('/login');
-            return false;
+            return true;
         }
 
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\NotificationControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/NotificationController.php:42:13
 
         if (empty($message)) {
             $_SESSION['error'] = "El mensaje no puede estar vacío.";
-            $this->redirectTo('/dashboard');
+            
             return false;
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\NotificationControllerTest.php" not found

[Killed] FalseValue
Controllers/NotificationController.php:43:13
         if (empty($message)) {
             $_SESSION['error'] = "El mensaje no puede estar vacío.";
             $this->redirectTo('/dashboard');
-            return false;
+            return true;
         }
 
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\NotificationControllerTest.php" not found

[Killed] IfNegation
Controllers/NotificationController.php:51:9
             'message' => $message
         ];
 
-        if ($this->notificationModel->createNotification($data)) {
-            $_SESSION['success'] = 'Notificación creada con éxito.';
-            $this->redirectTo('/dashboard');
-            return true;
-        } else {
-            $_SESSION['error'] = "Error al crear la notificación.";
-            $this->redirectTo('/dashboard');
-            return false;
-        }
+        if (!$this->notificationModel->createNotification($data)) {
     }
 
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\NotificationControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/NotificationController.php:53:13
 
         if ($this->notificationModel->createNotification($data)) {
             $_SESSION['success'] = 'Notificación creada con éxito.';
-            $this->redirectTo('/dashboard');
+            
             return true;
         } else {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\NotificationControllerTest.php" not found

[Killed] TrueValue
Controllers/NotificationController.php:54:13
         if ($this->notificationModel->createNotification($data)) {
             $_SESSION['success'] = 'Notificación creada con éxito.';
             $this->redirectTo('/dashboard');
-            return true;
+            return false;
         } else {
             $_SESSION['error'] = "Error al crear la notificación.";
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\NotificationControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/NotificationController.php:57:13
             return true;
         } else {
             $_SESSION['error'] = "Error al crear la notificación.";
-            $this->redirectTo('/dashboard');
+            
             return false;
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\NotificationControllerTest.php" not found

[Killed] PublicVisibility
Controllers/NotificationController.php:63:5
     }
 
     // Marcar una notificación como leída
-    public function markAsRead($id)
+    protected function markAsRead($id)
     {
         if ($this->notificationModel->markAsRead($id)) {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\NotificationControllerTest.php" not found

[Killed] IfNegation
Controllers/NotificationController.php:65:9
     // Marcar una notificación como leída
     public function markAsRead($id)
     {
-        if ($this->notificationModel->markAsRead($id)) {
-            $_SESSION['success'] = "Notificación marcada como leída.";
-            $this->redirectTo('/dashboard');
-            return true;
-        } else {
-            $_SESSION['error'] = "Error al marcar la notificación como leída.";
-            $this->redirectTo('/dashboard');
-            return false;
-        }
+        if (!$this->notificationModel->markAsRead($id)) {
     }
 
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\NotificationControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/NotificationController.php:67:13
     {
         if ($this->notificationModel->markAsRead($id)) {
             $_SESSION['success'] = "Notificación marcada como leída.";
-            $this->redirectTo('/dashboard');
+            
             return true;
         } else {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\NotificationControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/NotificationController.php:71:13
             return true;
         } else {
             $_SESSION['error'] = "Error al marcar la notificación como leída.";
-            $this->redirectTo('/dashboard');
+            
             return false;
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\NotificationControllerTest.php" not found

[Killed] PublicVisibility
Controllers/NotificationController.php:77:5
     }
 
     // Eliminar una notificación
-    public function delete($id)
+    protected function delete($id)
     {
         if ($this->notificationModel->deleteNotification($id)) {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\NotificationControllerTest.php" not found

[Killed] IfNegation
Controllers/NotificationController.php:79:9
     // Eliminar una notificación
     public function delete($id)
     {
-        if ($this->notificationModel->deleteNotification($id)) {
-            $_SESSION['success'] = "Notificación eliminada.";
-            $this->redirectTo('/dashboard');
-            return true;
-        } else {
-            $_SESSION['error'] = "Error al eliminar la notificación.";
-            $this->redirectTo('/dashboard');
-            return false;
-        }
+        if (!$this->notificationModel->deleteNotification($id)) {
     }
 
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\NotificationControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/NotificationController.php:81:13
     {
         if ($this->notificationModel->deleteNotification($id)) {
             $_SESSION['success'] = "Notificación eliminada.";
-            $this->redirectTo('/dashboard');
+            
             return true;
         } else {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\NotificationControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/NotificationController.php:85:13
             return true;
         } else {
             $_SESSION['error'] = "Error al eliminar la notificación.";
-            $this->redirectTo('/dashboard');
+            
             return false;
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\NotificationControllerTest.php" not found

[Killed] PublicVisibility
Controllers/NotificationController.php:91:5
     }
 
     // Mostrar las notificaciones del usuario
-    public function showNotifications($userId)
+    protected function showNotifications($userId)
     {
         if (!$userId) {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\NotificationControllerTest.php" not found

[Killed] FalseValue
Controllers/NotificationController.php:95:13
     {
         if (!$userId) {
             $this->redirectTo('/login');
-            return false; // Asegúrate de devolver false en este caso
+            return true;
         }
     
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\NotificationControllerTest.php" not found
