[Killed] Identical
Controllers/AuthController.php:16:9
         $this->userModel = new UserModel();
 
         // Verificar si la sesión ya está activa antes de iniciarla
-        if (session_status() === PHP_SESSION_NONE) {
+        if (session_status() !== PHP_SESSION_NONE) {
             session_start();
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] PublicVisibility
Controllers/AuthController.php:35:5
     }
 
     // Mostrar formulario de inicio de sesión
-    public function showLogin()
+    protected function showLogin()
     {
         if (isset($_SESSION['user'])) {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/AuthController.php:38:13
     public function showLogin()
     {
         if (isset($_SESSION['user'])) {
-            $this->redirectTo('/dashboard');
+            
             return;
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] ConcatOperandRemoval
Controllers/AuthController.php:42:9
             return;
         }
 
-        include __DIR__ . '/../Views/login.php';
+        include __DIR__;
     }
 
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] ConcatOperandRemoval
Controllers/AuthController.php:42:9
             return;
         }
 
-        include __DIR__ . '/../Views/login.php';
+        include '/../Views/login.php';
     }
 
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] PublicVisibility
Controllers/AuthController.php:46:5
     }
 
     // Mostrar formulario de registro
-    public function showRegister()
+    protected function showRegister()
     {
         if (isset($_SESSION['user'])) {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] ConcatOperandRemoval
Controllers/AuthController.php:53:9
             return;
         }
 
-        include __DIR__ . '/../Views/register.php';
+        include __DIR__;
     }
 
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] Concat
Controllers/AuthController.php:53:9
             return;
         }
 
-        include __DIR__ . '/../Views/register.php';
+        include '/../Views/register.php' . __DIR__;
     }
 
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] PublicVisibility
Controllers/AuthController.php:57:5
     }
 
     // Procesar inicio de sesión
-    public function login($data)
+    protected function login($data)
     {
         if (empty($data['email']) || empty($data['password'])) {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] LogicalOrAllSubExprNegation
Controllers/AuthController.php:59:9
     // Procesar inicio de sesión
     public function login($data)
     {
-        if (empty($data['email']) || empty($data['password'])) {
+        if (!empty($data['email']) || !empty($data['password'])) {
             $_SESSION['error'] = "Por favor, complete todos los campos.";
             $this->redirectTo('/login');
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] LogicalOrNegation
Controllers/AuthController.php:59:9
     // Procesar inicio de sesión
     public function login($data)
     {
-        if (empty($data['email']) || empty($data['password'])) {
+        if (!(empty($data['email']) || empty($data['password']))) {
             $_SESSION['error'] = "Por favor, complete todos los campos.";
             $this->redirectTo('/login');
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/AuthController.php:61:13
     {
         if (empty($data['email']) || empty($data['password'])) {
             $_SESSION['error'] = "Por favor, complete todos los campos.";
-            $this->redirectTo('/login');
+            
             return false;
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] LogicalAndSingleSubExprNegation
Controllers/AuthController.php:66:9
         }
 
         $user = $this->userModel->findUserByEmail($data['email']);
-        if ($user && password_verify($data['password'], $user['password'])) {
+        if (!$user && password_verify($data['password'], $user['password'])) {
             $_SESSION['user'] = $user['id'];
             $_SESSION['success'] = "Bienvenido, has iniciado sesión con éxito.";
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] LogicalAnd
Controllers/AuthController.php:66:9
         }
 
         $user = $this->userModel->findUserByEmail($data['email']);
-        if ($user && password_verify($data['password'], $user['password'])) {
+        if ($user || password_verify($data['password'], $user['password'])) {
             $_SESSION['user'] = $user['id'];
             $_SESSION['success'] = "Bienvenido, has iniciado sesión con éxito.";
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/AuthController.php:69:13
         if ($user && password_verify($data['password'], $user['password'])) {
             $_SESSION['user'] = $user['id'];
             $_SESSION['success'] = "Bienvenido, has iniciado sesión con éxito.";
-            $this->redirectTo('/dashboard');
+            
             return true;
         } else {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/AuthController.php:73:13
             return true;
         } else {
             $_SESSION['error'] = "Credenciales inválidas.";
-            $this->redirectTo('/login');
+            
             return false;
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] PublicVisibility
Controllers/AuthController.php:79:5
     }
 
     // Procesar registro de usuario
-    public function register($data)
+    protected function register($data)
     {
         if (empty($data['name']) || empty($data['email']) || empty($data['password'])) {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] LogicalOr
Controllers/AuthController.php:81:9
     // Procesar registro de usuario
     public function register($data)
     {
-        if (empty($data['name']) || empty($data['email']) || empty($data['password'])) {
+        if (empty($data['name']) && empty($data['email']) || empty($data['password'])) {
             $_SESSION['error'] = "Por favor, complete todos los campos.";
             $this->redirectTo('/register');
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] LogicalOr
Controllers/AuthController.php:81:9
     // Procesar registro de usuario
     public function register($data)
     {
-        if (empty($data['name']) || empty($data['email']) || empty($data['password'])) {
+        if ((empty($data['name']) || empty($data['email'])) && empty($data['password'])) {
             $_SESSION['error'] = "Por favor, complete todos los campos.";
             $this->redirectTo('/register');
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/AuthController.php:83:13
     {
         if (empty($data['name']) || empty($data['email']) || empty($data['password'])) {
             $_SESSION['error'] = "Por favor, complete todos los campos.";
-            $this->redirectTo('/register');
+            
             return false;
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] FalseValue
Controllers/AuthController.php:84:13
         if (empty($data['name']) || empty($data['email']) || empty($data['password'])) {
             $_SESSION['error'] = "Por favor, complete todos los campos.";
             $this->redirectTo('/register');
-            return false;
+            return true;
         }
 
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] IfNegation
Controllers/AuthController.php:88:9
         }
 
         $user = $this->userModel->findUserByEmail($data['email']);
-        if ($user) {
-            $_SESSION['error'] = "El correo ya está registrado.";
-            $this->redirectTo('/register');
-            return false;
-        }
+        if (!$user) {
 
         $data['password'] = password_hash($data['password'], PASSWORD_BCRYPT);
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/AuthController.php:90:13
         $user = $this->userModel->findUserByEmail($data['email']);
         if ($user) {
             $_SESSION['error'] = "El correo ya está registrado.";
-            $this->redirectTo('/register');
+            
             return false;
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] IfNegation
Controllers/AuthController.php:95:9
         }
 
         $data['password'] = password_hash($data['password'], PASSWORD_BCRYPT);
-        if ($this->userModel->createUser($data)) {
-            $_SESSION['success'] = "Usuario registrado con éxito. Por favor, inicia sesión.";
-            $this->redirectTo('/login');
-            return true;
-        } else {
-            $_SESSION['error'] = "Error al registrar al usuario.";
-            $this->redirectTo('/register');
-            return false;
-        }
+        if (!$this->userModel->createUser($data)) {
     }
 
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/AuthController.php:97:13
         $data['password'] = password_hash($data['password'], PASSWORD_BCRYPT);
         if ($this->userModel->createUser($data)) {
             $_SESSION['success'] = "Usuario registrado con éxito. Por favor, inicia sesión.";
-            $this->redirectTo('/login');
+            
             return true;
         } else {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] TrueValue
Controllers/AuthController.php:98:13
         if ($this->userModel->createUser($data)) {
             $_SESSION['success'] = "Usuario registrado con éxito. Por favor, inicia sesión.";
             $this->redirectTo('/login');
-            return true;
+            return false;
         } else {
             $_SESSION['error'] = "Error al registrar al usuario.";
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/AuthController.php:101:13
             return true;
         } else {
             $_SESSION['error'] = "Error al registrar al usuario.";
-            $this->redirectTo('/register');
+            
             return false;
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] PublicVisibility
Controllers/AuthController.php:107:5
     }
 
     // Cerrar sesión
-    public function logout()
+    protected function logout()
     {
         session_destroy();
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] FunctionCallRemoval
Controllers/AuthController.php:109:9
     // Cerrar sesión
     public function logout()
     {
-        session_destroy();
+        
         $_SESSION['success'] = "Has cerrado sesión exitosamente.";
         $this->redirectTo('/login');
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/AuthController.php:111:9
     {
         session_destroy();
         $_SESSION['success'] = "Has cerrado sesión exitosamente.";
-        $this->redirectTo('/login');
+        
         return true;
     }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found

[Killed] PublicVisibility
Controllers/AuthController.php:115:5
         return true;
     }
 
-    public function setUserModel($userModel)
+    protected function setUserModel($userModel)
     {
         $this->userModel = $userModel;
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\AuthControllerTest.php" not found
