[Killed] ProtectedVisibility
Controllers/TaskController.php:25:5
     }
 
     // Método para redirigir (real o simulado)
-    protected function redirectTo($url)
+    private function redirectTo($url)
     {
         if (getenv('APP_ENV') === 'testing') {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[NoCoverage] FunctionCallRemoval
Controllers/TaskController.php:32:13
             $this->redirect = $url;
         } else {
             // En producción, ejecuta la redirección real
-            header("Location: $url");
+            
             exit;
         }

[Killed] PublicVisibility
Controllers/TaskController.php:37:5
         }
     }
 
-    public function showTasks($userId)
+    protected function showTasks($userId)
     {
         // Obtener las tareas del usuario usando solo el ID
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] PublicVisibility
Controllers/TaskController.php:44:5
         return $tasks; // Devolver las tareas
     }
 
-    public function createTask($data)
+    protected function createTask($data)
     {
         if (!isset($data['category_id'])) {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] LogicalNot
Controllers/TaskController.php:46:9
 
     public function createTask($data)
     {
-        if (!isset($data['category_id'])) {
+        if (isset($data['category_id'])) {
             $_SESSION['error'] = "Faltan datos: category_id"; // Mensaje de error si falta category_id
             $this->redirectTo('/dashboard');
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/TaskController.php:48:13
     {
         if (!isset($data['category_id'])) {
             $_SESSION['error'] = "Faltan datos: category_id"; // Mensaje de error si falta category_id
-            $this->redirectTo('/dashboard');
+            
             return false;
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] IfNegation
Controllers/TaskController.php:54:9
 
         $data['user_id'] = $_SESSION['user']; // Asignar el ID del usuario directamente
 
-        if ($this->taskModel->createTask($data)) {
-            $_SESSION['success'] = 'Tarea creada con éxito.'; // Mensaje de éxito al crear tarea
-            $this->redirectTo('/dashboard');
-            return true;
-        } else {
-            $_SESSION['error'] = 'Error al crear la tarea.'; // Mensaje de error si no se crea la tarea
-            $this->redirectTo('/dashboard');
-            return false;
-        }
+        if (!$this->taskModel->createTask($data)) {
     }
 
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/TaskController.php:56:13
 
         if ($this->taskModel->createTask($data)) {
             $_SESSION['success'] = 'Tarea creada con éxito.'; // Mensaje de éxito al crear tarea
-            $this->redirectTo('/dashboard');
+            
             return true;
         } else {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/TaskController.php:60:13
             return true;
         } else {
             $_SESSION['error'] = 'Error al crear la tarea.'; // Mensaje de error si no se crea la tarea
-            $this->redirectTo('/dashboard');
+            
             return false;
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] PublicVisibility
Controllers/TaskController.php:65:5
         }
     }
 
-    public function showCreateTaskForm()
+    protected function showCreateTaskForm()
     {
         $categories = $this->categoryModel->getCategories();
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] ConcatOperandRemoval
Controllers/TaskController.php:68:9
     public function showCreateTaskForm()
     {
         $categories = $this->categoryModel->getCategories();
-        include __DIR__ . '/../Views/create_task.php';
+        include '/../Views/create_task.php';
     }
 
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] ConcatOperandRemoval
Controllers/TaskController.php:68:9
     public function showCreateTaskForm()
     {
         $categories = $this->categoryModel->getCategories();
-        include __DIR__ . '/../Views/create_task.php';
+        include __DIR__;
     }
 
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] PublicVisibility
Controllers/TaskController.php:71:5
         include __DIR__ . '/../Views/create_task.php';
     }
 
-    public function editTask($id, $data)
+    protected function editTask($id, $data)
     {
         if (empty($data['title']) || empty($data['description']) || !isset($data['category_id'])) {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] LogicalOr
Controllers/TaskController.php:73:9
 
     public function editTask($id, $data)
     {
-        if (empty($data['title']) || empty($data['description']) || !isset($data['category_id'])) {
+        if (empty($data['title']) && empty($data['description']) || !isset($data['category_id'])) {
             $_SESSION['error'] = "Faltan datos para actualizar la tarea."; // Error si faltan datos
             $this->redirectTo('/dashboard');
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] LogicalOrNegation
Controllers/TaskController.php:73:9
 
     public function editTask($id, $data)
     {
-        if (empty($data['title']) || empty($data['description']) || !isset($data['category_id'])) {
+        if (!(empty($data['title']) || empty($data['description']) || !isset($data['category_id']))) {
             $_SESSION['error'] = "Faltan datos para actualizar la tarea."; // Error si faltan datos
             $this->redirectTo('/dashboard');
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/TaskController.php:75:13
     {
         if (empty($data['title']) || empty($data['description']) || !isset($data['category_id'])) {
             $_SESSION['error'] = "Faltan datos para actualizar la tarea."; // Error si faltan datos
-            $this->redirectTo('/dashboard');
+            
             return false;
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] IfNegation
Controllers/TaskController.php:81:9
 
         $data['id'] = $id;
 
-        if ($this->taskModel->updateTask($data)) {
-            $_SESSION['success'] = 'Tarea actualizada con éxito.'; // Mensaje de éxito
-            $this->redirectTo('/dashboard');
-            return true;
-        } else {
-            $_SESSION['error'] = 'Error al editar la tarea.'; // Mensaje de error
-            $this->redirectTo('/dashboard');
-            return false;
-        }
+        if (!$this->taskModel->updateTask($data)) {
     }
 
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/TaskController.php:83:13
 
         if ($this->taskModel->updateTask($data)) {
             $_SESSION['success'] = 'Tarea actualizada con éxito.'; // Mensaje de éxito
-            $this->redirectTo('/dashboard');
+            
             return true;
         } else {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/TaskController.php:87:13
             return true;
         } else {
             $_SESSION['error'] = 'Error al editar la tarea.'; // Mensaje de error
-            $this->redirectTo('/dashboard');
+            
             return false;
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] PublicVisibility
Controllers/TaskController.php:92:5
         }
     }
 
-    public function deleteTask($id)
+    protected function deleteTask($id)
     {
         if ($this->taskModel->deleteTask($id)) {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] IfNegation
Controllers/TaskController.php:94:9
 
     public function deleteTask($id)
     {
-        if ($this->taskModel->deleteTask($id)) {
-            $_SESSION['success'] = 'Tarea eliminada con éxito.'; // Mensaje de éxito al eliminar la tarea
-            $this->redirectTo('/dashboard');
-            return true;
-        } else {
-            $_SESSION['error'] = 'Error al eliminar la tarea.'; // Mensaje de error si falla la eliminación
-            $this->redirectTo('/dashboard');
-            return false;
-        }
+        if (!$this->taskModel->deleteTask($id)) {
     }
 
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/TaskController.php:96:13
     {
         if ($this->taskModel->deleteTask($id)) {
             $_SESSION['success'] = 'Tarea eliminada con éxito.'; // Mensaje de éxito al eliminar la tarea
-            $this->redirectTo('/dashboard');
+            
             return true;
         } else {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] MethodCallRemoval
Controllers/TaskController.php:100:13
             return true;
         } else {
             $_SESSION['error'] = 'Error al eliminar la tarea.'; // Mensaje de error si falla la eliminación
-            $this->redirectTo('/dashboard');
+            
             return false;
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[NoCoverage] PublicVisibility
Controllers/TaskController.php:105:5
         }
     }
 
-    public function getTaskById($id)
+    protected function getTaskById($id)
     {
         return $this->taskModel->getTaskById($id);

[Killed] PublicVisibility
Controllers/TaskController.php:110:5
         return $this->taskModel->getTaskById($id);
     }
 
-    public function showEditTaskForm($id)
+    protected function showEditTaskForm($id)
     {
         // Obtener la tarea por ID
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] LogicalNot
Controllers/TaskController.php:116:9
         $task = $this->taskModel->getTaskById($id);
     
         // Si no se encuentra la tarea, muestra un mensaje de error y termina
-        if (!$task) {
+        if ($task) {
             echo "Tarea no encontrada.";
             return;
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] Coalesce
Controllers/TaskController.php:125:9
         $categories = $this->categoryModel->getCategories();
     
         // Inicializar valores predeterminados para claves de tarea
-        $task['is_completed'] = $task['is_completed'] ?? 0; // Valor predeterminado si no existe
+        $task['is_completed'] = 0 ?? $task['is_completed'];
     
         // Incluir la vista y pasar las variables necesarias
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] IncrementInteger
Controllers/TaskController.php:125:9
         $categories = $this->categoryModel->getCategories();
     
         // Inicializar valores predeterminados para claves de tarea
-        $task['is_completed'] = $task['is_completed'] ?? 0; // Valor predeterminado si no existe
+        $task['is_completed'] = $task['is_completed'] ?? 1;
     
         // Incluir la vista y pasar las variables necesarias
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] Concat
Controllers/TaskController.php:128:9
         $task['is_completed'] = $task['is_completed'] ?? 0; // Valor predeterminado si no existe
     
         // Incluir la vista y pasar las variables necesarias
-        include __DIR__ . '/../Views/edit_task.php';
+        include '/../Views/edit_task.php' . __DIR__;
     }
     
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found

[Killed] ConcatOperandRemoval
Controllers/TaskController.php:128:9
         $task['is_completed'] = $task['is_completed'] ?? 0; // Valor predeterminado si no existe
     
         // Incluir la vista y pasar las variables necesarias
-        include __DIR__ . '/../Views/edit_task.php';
+        include '/../Views/edit_task.php';
     }
     
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Functional\TaskControllerTest.php" not found
