[Killed] PublicVisibility
Models/CategoryModel.php:8:5
 {
     public $conn;
     // Crear categoría
-    public function createCategory($data)
+    protected function createCategory($data)
     {
         // Verificar que los datos recibidos sean correctos
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\CategoryModelTest.php" not found

[Killed] FalseValue
Models/CategoryModel.php:16:13
             return $stmt->execute($data);
         } else {
             // Si falta el campo 'name', manejar el error
-            return false;
+            return true;
         }
     }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\CategoryModelTest.php" not found

[Killed] PublicVisibility
Models/CategoryModel.php:21:5
     }
 
     // Obtener todas las categorías
-    public function getCategories()
+    protected function getCategories()
     {
         $stmt = $this->conn->prepare("SELECT * FROM categories");
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\CategoryModelTest.php" not found

[Killed] MethodCallRemoval
Models/CategoryModel.php:24:9
     public function getCategories()
     {
         $stmt = $this->conn->prepare("SELECT * FROM categories");
-        $stmt->execute();
+        
         return $stmt->fetchAll(\PDO::FETCH_ASSOC);
     }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\CategoryModelTest.php" not found

[Killed] PublicVisibility
Models/CategoryModel.php:29:5
     }
 
     // Obtener categoría por ID
-    public function getCategoryById($id)
+    protected function getCategoryById($id)
     {
         $stmt = $this->conn->prepare("SELECT * FROM categories WHERE id = :id");
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\CategoryModelTest.php" not found

[Killed] MethodCallRemoval
Models/CategoryModel.php:32:9
     public function getCategoryById($id)
     {
         $stmt = $this->conn->prepare("SELECT * FROM categories WHERE id = :id");
-        $stmt->bindParam(':id', $id);
+        
         $stmt->execute();
         return $stmt->fetch(); // Retorna la categoría encontrada o null si no existe
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\CategoryModelTest.php" not found

[Killed] MethodCallRemoval
Models/CategoryModel.php:33:9
     {
         $stmt = $this->conn->prepare("SELECT * FROM categories WHERE id = :id");
         $stmt->bindParam(':id', $id);
-        $stmt->execute();
+        
         return $stmt->fetch(); // Retorna la categoría encontrada o null si no existe
     }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\CategoryModelTest.php" not found

[Killed] PublicVisibility
Models/CategoryModel.php:38:5
     }
 
     // Actualizar categoría
-    public function updateCategory($data)
+    protected function updateCategory($data)
     {
         // Asegúrate de que el 'id' esté presente en el arreglo de datos
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\CategoryModelTest.php" not found

[Killed] LogicalOr
Models/CategoryModel.php:41:9
     public function updateCategory($data)
     {
         // Asegúrate de que el 'id' esté presente en el arreglo de datos
-        if (!isset($data['id']) || !isset($data['name'])) {
+        if (!isset($data['id']) && !isset($data['name'])) {
             return false;  // Si falta el 'id' o el 'name', no actualices
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\CategoryModelTest.php" not found

[Killed] LogicalNot
Models/CategoryModel.php:41:9
     public function updateCategory($data)
     {
         // Asegúrate de que el 'id' esté presente en el arreglo de datos
-        if (!isset($data['id']) || !isset($data['name'])) {
+        if (!isset($data['id']) || isset($data['name'])) {
             return false;  // Si falta el 'id' o el 'name', no actualices
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\CategoryModelTest.php" not found

[Killed] FalseValue
Models/CategoryModel.php:42:13
     {
         // Asegúrate de que el 'id' esté presente en el arreglo de datos
         if (!isset($data['id']) || !isset($data['name'])) {
-            return false;  // Si falta el 'id' o el 'name', no actualices
+            return true;
         }
 
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\CategoryModelTest.php" not found

[Killed] MethodCallRemoval
Models/CategoryModel.php:52:9
         $stmt = $this->conn->prepare($query);
         
         // Bind de los parámetros
-        $stmt->bindParam(':name', $data['name']);
+        
         $stmt->bindParam(':id', $data['id']);
         
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\CategoryModelTest.php" not found

[Killed] MethodCallRemoval
Models/CategoryModel.php:53:9
         
         // Bind de los parámetros
         $stmt->bindParam(':name', $data['name']);
-        $stmt->bindParam(':id', $data['id']);
+        
         
         // Ejecutar la consulta
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\CategoryModelTest.php" not found

[Killed] PublicVisibility
Models/CategoryModel.php:60:5
     }
 
     // Eliminar categoría
-    public function deleteCategory($id)
+    protected function deleteCategory($id)
     {
         $stmt = $this->conn->prepare("DELETE FROM categories WHERE id = :id");
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\CategoryModelTest.php" not found

[Killed] ArrayItemRemoval
Models/CategoryModel.php:63:9
     public function deleteCategory($id)
     {
         $stmt = $this->conn->prepare("DELETE FROM categories WHERE id = :id");
-        return $stmt->execute(['id' => $id]);
+        return $stmt->execute([]);
     }
 }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\CategoryModelTest.php" not found
