[Killed] ConcatOperandRemoval
Models/Database.php:14:9
 
     public function __construct()
     {
-        $config = include __DIR__ . '/../../config/database.php';
+        $config = include '/../../config/database.php';
     
         if (empty($config['host']) || empty($config['db']) || empty($config['user']) || !isset($config['pass'])) {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\NotificationModelTest.php" not found

[Killed] ConcatOperandRemoval
Models/Database.php:14:9
 
     public function __construct()
     {
-        $config = include __DIR__ . '/../../config/database.php';
+        $config = include __DIR__;
     
         if (empty($config['host']) || empty($config['db']) || empty($config['user']) || !isset($config['pass'])) {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\NotificationModelTest.php" not found

[Killed] LogicalOr
Models/Database.php:16:9
     {
         $config = include __DIR__ . '/../../config/database.php';
     
-        if (empty($config['host']) || empty($config['db']) || empty($config['user']) || !isset($config['pass'])) {
+        if ((empty($config['host']) || empty($config['db']) || empty($config['user'])) && !isset($config['pass'])) {
             throw new \InvalidArgumentException("Invalid database configuration.");
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\NotificationModelTest.php" not found

[Killed] LogicalOr
Models/Database.php:16:9
     {
         $config = include __DIR__ . '/../../config/database.php';
     
-        if (empty($config['host']) || empty($config['db']) || empty($config['user']) || !isset($config['pass'])) {
+        if (empty($config['host']) && empty($config['db']) || empty($config['user']) || !isset($config['pass'])) {
             throw new \InvalidArgumentException("Invalid database configuration.");
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\NotificationModelTest.php" not found

[NoCoverage] Throw_
Models/Database.php:17:13
         $config = include __DIR__ . '/../../config/database.php';
     
         if (empty($config['host']) || empty($config['db']) || empty($config['user']) || !isset($config['pass'])) {
-            throw new \InvalidArgumentException("Invalid database configuration.");
+            new \InvalidArgumentException("Invalid database configuration.");
         }
     

[Killed] MethodCallRemoval
Models/Database.php:26:13
                 $config['user'],
                 $config['pass']
             );
-            $this->conn->setAttribute(PDO::ATTR_ERRMODE, PDO::ERRMODE_EXCEPTION);
+            
         } catch (PDOException $e) {
             throw new PDOException("Connection failed: " . $e->getMessage(), (int)$e->getCode(), $e);
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\NotificationModelTest.php" not found

[NoCoverage] ConcatOperandRemoval
Models/Database.php:28:13
             );
             $this->conn->setAttribute(PDO::ATTR_ERRMODE, PDO::ERRMODE_EXCEPTION);
         } catch (PDOException $e) {
-            throw new PDOException("Connection failed: " . $e->getMessage(), (int)$e->getCode(), $e);
+            throw new PDOException("Connection failed: ", (int) $e->getCode(), $e);
         }
     }

[NoCoverage] Concat
Models/Database.php:28:13
             );
             $this->conn->setAttribute(PDO::ATTR_ERRMODE, PDO::ERRMODE_EXCEPTION);
         } catch (PDOException $e) {
-            throw new PDOException("Connection failed: " . $e->getMessage(), (int)$e->getCode(), $e);
+            throw new PDOException($e->getMessage() . "Connection failed: ", (int) $e->getCode(), $e);
         }
     }

[Killed] PublicVisibility
Models/Database.php:33:5
     }
     
     // Método para acceder a la conexión
-    public function getConnection()
+    protected function getConnection()
     {
         return $this->conn;
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Integration\DatabaseTest.php" not found
