[Killed] PublicVisibility
Models/NotificationModel.php:10:5
 {
     public $conn;
     // Crear notificación
-    public function createNotification($data)
+    protected function createNotification($data)
     {
         if (isset($data['user_id'], $data['message'])) {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\NotificationModelTest.php" not found

[Killed] FalseValue
Models/NotificationModel.php:17:13
             return $stmt->execute($data);
         } else {
             // Si falta algún campo, manejar el error
-            return false;
+            return true;
         }
     }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\NotificationModelTest.php" not found

[Killed] PublicVisibility
Models/NotificationModel.php:22:5
     }
 
     // Obtener notificaciones de un usuario
-    public function getNotificationsByUser($userId)
+    protected function getNotificationsByUser($userId)
     {
         $stmt = $this->conn->prepare("SELECT * FROM notifications WHERE user_id = :user_id ORDER BY created_at DESC");
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\NotificationModelTest.php" not found

[Killed] MethodCallRemoval
Models/NotificationModel.php:25:9
     public function getNotificationsByUser($userId)
     {
         $stmt = $this->conn->prepare("SELECT * FROM notifications WHERE user_id = :user_id ORDER BY created_at DESC");
-        $stmt->execute(['user_id' => $userId]);
+        
         return $stmt->fetchAll(\PDO::FETCH_ASSOC);
     }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\NotificationModelTest.php" not found

[Killed] PublicVisibility
Models/NotificationModel.php:30:5
     }
 
     // Marcar notificación como leída
-    public function markAsRead($id)
+    protected function markAsRead($id)
     {
         $stmt = $this->conn->prepare("UPDATE notifications SET is_read = 1 WHERE id = :id");
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\NotificationModelTest.php" not found

[Killed] PublicVisibility
Models/NotificationModel.php:37:5
     }
 
     // Eliminar notificación
-    public function deleteNotification($id)
+    protected function deleteNotification($id)
     {
         $stmt = $this->conn->prepare("DELETE FROM notifications WHERE id = :id");
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\NotificationModelTest.php" not found
