[Killed] PublicVisibility
Models/TaskModel.php:17:5
         return false;
     }
 
-    public function getTasksByUser($userId)
+    protected function getTasksByUser($userId)
     {
         $stmt = $this->conn->prepare("SELECT tasks.*, categories.name AS category_name FROM tasks LEFT JOIN categories ON tasks.category_id = categories.id WHERE tasks.user_id = :user_id");
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\TaskModelTest.php" not found

[Killed] MethodCallRemoval
Models/TaskModel.php:20:9
     public function getTasksByUser($userId)
     {
         $stmt = $this->conn->prepare("SELECT tasks.*, categories.name AS category_name FROM tasks LEFT JOIN categories ON tasks.category_id = categories.id WHERE tasks.user_id = :user_id");
-        $stmt->execute(['user_id' => $userId]);
+        
         return $stmt->fetchAll(\PDO::FETCH_ASSOC);
     }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\TaskModelTest.php" not found

[Killed] PublicVisibility
Models/TaskModel.php:24:5
         return $stmt->fetchAll(\PDO::FETCH_ASSOC);
     }
 
-    public function updateTask($data)
+    protected function updateTask($data)
     {
         if (!isset($data['id'], $data['title'], $data['category_id'])) {
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\TaskModelTest.php" not found

[Killed] LogicalNot
Models/TaskModel.php:26:9
 
     public function updateTask($data)
     {
-        if (!isset($data['id'], $data['title'], $data['category_id'])) {
+        if (isset($data['id'], $data['title'], $data['category_id'])) {
             return false;
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\TaskModelTest.php" not found

[Killed] FalseValue
Models/TaskModel.php:27:13
     public function updateTask($data)
     {
         if (!isset($data['id'], $data['title'], $data['category_id'])) {
-            return false;
+            return true;
         }
 
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\TaskModelTest.php" not found

[Killed] MethodCallRemoval
Models/TaskModel.php:31:9
         }
 
         $stmt = $this->conn->prepare("UPDATE tasks SET title = :title, description = :description, category_id = :category_id, due_date = :due_date, is_completed = :is_completed WHERE id = :id");
-        $stmt->bindParam(':title', $data['title']);
+        
         $stmt->bindParam(':description', $data['description']);
         $stmt->bindParam(':category_id', $data['category_id']);
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\TaskModelTest.php" not found

[Killed] MethodCallRemoval
Models/TaskModel.php:32:9
 
         $stmt = $this->conn->prepare("UPDATE tasks SET title = :title, description = :description, category_id = :category_id, due_date = :due_date, is_completed = :is_completed WHERE id = :id");
         $stmt->bindParam(':title', $data['title']);
-        $stmt->bindParam(':description', $data['description']);
+        
         $stmt->bindParam(':category_id', $data['category_id']);
         $stmt->bindParam(':due_date', $data['due_date']);
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\TaskModelTest.php" not found

[Killed] MethodCallRemoval
Models/TaskModel.php:33:9
         $stmt = $this->conn->prepare("UPDATE tasks SET title = :title, description = :description, category_id = :category_id, due_date = :due_date, is_completed = :is_completed WHERE id = :id");
         $stmt->bindParam(':title', $data['title']);
         $stmt->bindParam(':description', $data['description']);
-        $stmt->bindParam(':category_id', $data['category_id']);
+        
         $stmt->bindParam(':due_date', $data['due_date']);
         $stmt->bindParam(':is_completed', $data['is_completed']);
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\TaskModelTest.php" not found

[Killed] MethodCallRemoval
Models/TaskModel.php:34:9
         $stmt->bindParam(':title', $data['title']);
         $stmt->bindParam(':description', $data['description']);
         $stmt->bindParam(':category_id', $data['category_id']);
-        $stmt->bindParam(':due_date', $data['due_date']);
+        
         $stmt->bindParam(':is_completed', $data['is_completed']);
         $stmt->bindParam(':id', $data['id']);
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\TaskModelTest.php" not found

[Killed] MethodCallRemoval
Models/TaskModel.php:35:9
         $stmt->bindParam(':description', $data['description']);
         $stmt->bindParam(':category_id', $data['category_id']);
         $stmt->bindParam(':due_date', $data['due_date']);
-        $stmt->bindParam(':is_completed', $data['is_completed']);
+        
         $stmt->bindParam(':id', $data['id']);
         return $stmt->execute();
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\TaskModelTest.php" not found

[Killed] MethodCallRemoval
Models/TaskModel.php:36:9
         $stmt->bindParam(':category_id', $data['category_id']);
         $stmt->bindParam(':due_date', $data['due_date']);
         $stmt->bindParam(':is_completed', $data['is_completed']);
-        $stmt->bindParam(':id', $data['id']);
+        
         return $stmt->execute();
     }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\TaskModelTest.php" not found

[Killed] ArrayItemRemoval
Models/TaskModel.php:43:9
     public function deleteTask($id)
     {
         $stmt = $this->conn->prepare("DELETE FROM tasks WHERE id = :id");
-        return $stmt->execute(['id' => $id]);
+        return $stmt->execute([]);
     }
 
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\TaskModelTest.php" not found

[Killed] MethodCallRemoval
Models/TaskModel.php:49:9
     public function getTaskById($id)
     {
         $stmt = $this->conn->prepare("SELECT tasks.*, categories.name AS category_name FROM tasks LEFT JOIN categories ON tasks.category_id = categories.id WHERE tasks.id = :id");
-        $stmt->bindParam(':id', $id);
+        
         $stmt->execute();
         return $stmt->fetch();
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\TaskModelTest.php" not found
