[Killed] PublicVisibility
Models/UserModel.php:7:5
 
 class UserModel extends Database
 {
-    public function findUserByEmail($email)
+    protected function findUserByEmail($email)
     {
         $stmt = $this->conn->prepare("SELECT * FROM users WHERE email = :email");
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\UserModelTest.php" not found

[Killed] MethodCallRemoval
Models/UserModel.php:10:9
     public function findUserByEmail($email)
     {
         $stmt = $this->conn->prepare("SELECT * FROM users WHERE email = :email");
-        $stmt->execute(['email' => $email]);
+        
         
         // Si no se encuentra ningún usuario, devolver null
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\UserModelTest.php" not found

[Killed] Identical
Models/UserModel.php:14:9
         
         // Si no se encuentra ningún usuario, devolver null
         $user = $stmt->fetch(\PDO::FETCH_ASSOC);
-        return $user === false ? null : $user;
+        return $user !== false ? null : $user;
     }
     
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\UserModelTest.php" not found

[Killed] FalseValue
Models/UserModel.php:14:9
         
         // Si no se encuentra ningún usuario, devolver null
         $user = $stmt->fetch(\PDO::FETCH_ASSOC);
-        return $user === false ? null : $user;
+        return $user === true ? null : $user;
     }
     
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\UserModelTest.php" not found

[Killed] PublicVisibility
Models/UserModel.php:18:5
     }
     
 
-    public function createUser($data)
+    protected function createUser($data)
     {
         // Verificar si los campos obligatorios están presentes
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\UserModelTest.php" not found

[Killed] LogicalOrAllSubExprNegation
Models/UserModel.php:21:9
     public function createUser($data)
     {
         // Verificar si los campos obligatorios están presentes
-        if (empty($data['name']) || empty($data['email']) || empty($data['password'])) {
+        if (!empty($data['name']) || !empty($data['email']) || !empty($data['password'])) {
             return false; // Retornar false si falta algún campo
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\UserModelTest.php" not found

[Killed] LogicalOr
Models/UserModel.php:21:9
     public function createUser($data)
     {
         // Verificar si los campos obligatorios están presentes
-        if (empty($data['name']) || empty($data['email']) || empty($data['password'])) {
+        if ((empty($data['name']) || empty($data['email'])) && empty($data['password'])) {
             return false; // Retornar false si falta algún campo
         }
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\UserModelTest.php" not found

[Killed] FalseValue
Models/UserModel.php:22:13
     {
         // Verificar si los campos obligatorios están presentes
         if (empty($data['name']) || empty($data['email']) || empty($data['password'])) {
-            return false; // Retornar false si falta algún campo
+            return true;
         }
     
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\UserModelTest.php" not found

[Killed] MethodCallRemoval
Models/UserModel.php:27:9
     
         // Verificar si el correo electrónico ya existe
         $stmt = $this->conn->prepare("SELECT COUNT(*) FROM users WHERE email = :email");
-        $stmt->execute([':email' => $data['email']]);
+        
         $emailExists = $stmt->fetchColumn();
     
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\UserModelTest.php" not found

[Killed] GreaterThan
Models/UserModel.php:30:9
         $stmt->execute([':email' => $data['email']]);
         $emailExists = $stmt->fetchColumn();
     
-        if ($emailExists > 0) {
+        if ($emailExists >= 0) {
             // Si el correo ya existe, retornamos false
             return false;
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\UserModelTest.php" not found

[Killed] GreaterThanNegotiation
Models/UserModel.php:30:9
         $stmt->execute([':email' => $data['email']]);
         $emailExists = $stmt->fetchColumn();
     
-        if ($emailExists > 0) {
+        if ($emailExists <= 0) {
             // Si el correo ya existe, retornamos false
             return false;
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\UserModelTest.php" not found

[Killed] FalseValue
Models/UserModel.php:32:13
     
         if ($emailExists > 0) {
             // Si el correo ya existe, retornamos false
-            return false;
+            return true;
         }
     
statusReason: PHPUnit 11.4.3 by Sebastian Bergmann and contributors.

Test file "/tmp/infection/C:\Users\TheGoat\Downloads\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\proyecto-si784-2024-ii-u2-ayma_tapia_poma-main\project\tests\Unit\UserModelTest.php" not found
